---
kind: method
id: M:Autodesk.Revit.DB.SolidCurveIntersection.GetCurveSegment(System.Int32)
source: html/756d7940-d98b-031a-3c13-13808f349bb2.htm
---
# Autodesk.Revit.DB.SolidCurveIntersection.GetCurveSegment Method

Gets the curve segment generated by intersection.

## Syntax (C#)
```csharp
public Curve GetCurveSegment(
	int index
)
```

## Parameters
- **index** (`System.Int32`) - The index.

## Returns
The curve.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - index is out of range.